// 1. Суммирование аргументов
// Реализуйте функцию sum, которая принимает произвольное количество аргументов и возвращает их сумму.

// Ошибки, которые должны быть обработаны:

// Не переданы хотя бы два аргумента. Код ошибки INVALID_ARGUMENTS_COUNT.
// Хотя бы один из аргументов не типа number. Код ошибки INVALID_ARGUMENT.
// Примеры использования:

// sum(1, 2, 3);        // 6
// sum();               // ошибка с кодом INVALID_ARGUMENTS_COUNT
// sum(0, 1, '1', 2); // ошибка с кодом INVALID_ARGUMENT
