// 7. Римские цифры *
// Создайте функцию, принимающую в качестве параметра положительное целое число от до 1( 3999оба значения включены) и возвращающую строку, содержащую римское числовое представление этого целого числа.

// Современные римские цифры записываются путем записи каждой цифры отдельно, начиная с самой левой цифры и пропуская любую цифру со значением ноль. Не может быть более 3 одинаковых символов подряд.

// Римскими цифрами:

// 1990отображается: 1000= M+ 900= CM+ 90= XC; в результате получается MCMXC.
// 2008записывается как 2000= MM, 8= VIII; или MMVIII.
// 1666использует каждый римский символ в порядке убывания: MDCLXVI.
// Пример:

//    1 -->       "I"
// 1000 -->       "M"
// 1666 --> "MDCLXVI"
